
public class Problem01 {

	// Имате двумерен масив 6х5 от естествени числа, чийто стойности са въведени предварително.
	// Да се състави програма, чрез която се извеждат елементите от масива с най-малката и най-голямата стойност.
	// Пример:
	// 48,72,13,14,15
	// 21,22,53,24,75
	// 31,57,33,34,35
	// 41,95,43,44,45
	// 59,52,53,54,55
	// 61,69,63,64,65
	// Изход:
	// най-малко 13;
	// най-голямо 95

	public static void main(String[] args) {
		int[][] a = { { 48, 72, 13, 14, 15 },
				{ 21, 22, 53, 24, 75 },
				{ 31, 57, 33, 34, 35 },
				{ 41, 95, 43, 44, 45 },
				{ 59, 52, 53, 54, 55 },
				{ 61, 69, 63, 64, 65 } };
		int max = Integer.MIN_VALUE;
		int min = Integer.MAX_VALUE;
		for (int row = 0; row < a.length; row++) {
			for (int col = 0; col < a[0].length; col++) {
				if (a[row][col] > max) {
					max = a[row][col];
				}
				if (a[row][col] < min) {
					min = a[row][col];
				}
			}
		}
		System.out.println("най-малко: "+min);
		System.out.println("най-голямо: "+max);
	}
}
