
public class Problem07 {
	
//	Имате предварително въведени стойности от естествени числа, въведени в квадратна таблица с размери 6 реда и 6 колони.
//	Да се състави програма, чрез която се намира сумата на всички елементи, чиято сума на индекси за ред и колона е 
//	четно число. Програмата да извежда формираните суми за всеки отделен ред на квадратната таблица, както и общата
//	сума от тези елементи. Да се използва само един цикъл.
//	11,12,13,14,15,16,
//	21,22,23,24,25,26,
//	31,32,33,34,35,36,
//	41,42,43,44,45,46,
//	51,52,53,54,55,56,
//	61,62,63,64,65,66
//	Изход:
//	11, ,13, ,15, , сума от елементите за реда: 39
//	22, ,24, ,26, сума от елементите за реда: 72
//	31, ,33, ,35, , сума от елементите за реда: 99
//	42, ,44, ,46, сума от елементите за реда: 132
//	51, ,53, ,55, , сума от елементите за реда: 159
//	62, ,64, ,66 сума от елементите за реда: 192
//	Сума на елементите: 693

	public static void main(String[] args) {
		int[][] a = { { 11, 12, 13, 14, 15, 16 },
				{ 21, 22, 23, 24, 25, 26 },
				{ 31, 32, 33, 34, 35, 36 },
				{ 41, 42, 43, 44, 45, 46 },
				{ 51, 52, 53, 54, 55, 56 },
				{ 61, 62, 63, 64, 65, 66 } };
		int sumR = 0;
		int sumAll = 0;
		for (int r = 0; r < a.length; r++) {
			for (int c = 0; c < a[0].length; c++) {
				if((c+r)%2==0){
					System.out.print(a[r][c]+", ");
					sumR+=a[r][c];
					if((c == (a[0].length-1))||(c == (a[0].length-2))){
						System.out.println("сума от елементи за реда: "+sumR);
						sumAll+=sumR;
						sumR=0;
					}
				}
			}
		}
		System.out.println("Сума на елементите: "+sumAll);
	}

}
