
public class Problem16 {

	// Да се състави програма, чрез която предварително въведени 10 реални числа
	// от интервала се обработват по следния начин:
	// 1. Извежда съществуващите числа.
	// 2. Всички елементи със стойност по-малки от -0.231 се заменят със сумата
	// от квадрата на индекса им + числото 41.25, а всички останали елементи се 
	// заменят с произведението между самия елемент и неговият пореден номер
	// 3. Да се изведат елементите от началния и новообразувания масив.
	// 4. Да се изведат средната стойност на всички елементи от новата редица,
	// които са различни от 0.
	//
	// Пример: -1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4
	// Изход: 42.25, 45.25, 9.3, 16.8, 0, 38.4, 90.25, 68.8, 81.9,141.25

	public static void main(String[] args) {
		double[] a = { -1.12, -2.43, 3.1, 4.2, 0, 6.4, -7.5, 8.6, 9.1, -4 };
		double count = 0;
		double sum =0;
		System.out.print("Първоначалните стойности на масива са: ");
		for(int i=0; i<a.length; i++){
			System.out.print(a[i]+", ");
		}
		for(int i=0; i<a.length; i++){
			if(a[i]<-0.231){
				a[i]=(i*i)+41.25;
			}else{
				a[i]*=i;
			}
		}
		System.out.println();
		System.out.print("Променените стойности на масива са: ");
		for(int i=0; i<a.length; i++){
			System.out.print(a[i]+", ");
		}
		for(int i=0; i<a.length; i++){
			if(a[i]!=0){
				sum+=a[i];
				count++;
			}
		}
		double avrg = sum/count;
		System.out.println();
		System.out.println("Средната стойност на всички елементи от новата редица, които са различни от нула е: "+avrg);
	}

}
